Autodesk.Revit.DB.Mechanical.DuctLossMethodType
An enumerated type listing all duct loss calculation methods for a connector.

Autodesk.Revit.DB.Mechanical.DuctLossMethodType.Coefficient
Duct loss method depends on the loss coefficient.

Autodesk.Revit.DB.Mechanical.DuctLossMethodType.SpecificLoss
Duct loss method is specified.

Autodesk.Revit.DB.Mechanical.DuctLossMethodType.NotDefined
Duct loss method is undefined.